book-collection-backend/app/controllers/api/v1/books_controller.rb

INSERT INTO "books" ("title", "author", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My First Book of Planets"], ["author", "Bruce Betts PhD "], ["user_id", 1], ["created_at", "2021-02-20 01:02:17.280282"], ["updated_at", "2021-02-20 01:02:17.280282"]]
---
    def create
        # binding.pry
        book = Book.create(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
    def destroy
        book = Book.find_by(id: params[:id])
        book.destroy