book-collection-backend/app/controllers/api/v1/users_controller.rb

    def create
        if user = User.find_by(name: user_params[:name])
            redirect_to "/api/v1/users/#{user.id}"
        else
            user = User.new(user_params)
            if user.save
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Zainab"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Batman"], ["created_at", "2021-02-25 22:13:03.262234"], ["updated_at", "2021-02-25 22:13:03.262234"]]